// 연산자 -> 1개 이상의 피연산자와 함께 사용해서 계산을 하는 특수기호나 문구

// [산술연산자]
// 사칙연산. 나누기 곱하기 -> 키보드에 없음. -> 엑셀.

// + - * /
console.log("1 + 1 =", 1 + 1);
console.log("2 - 3 =", 2 - 3);
console.log("3 * 4 =", 3 * 4);
console.log("5 / 10 =", 5 / 10); // `//`는 주석이고. / 나누기.
// % **
console.log("100 / 8 =", 100 / 8);
console.log("100 % 8 =", 100 % 8); // 나머지
console.log("2 ** 4 =", 2 ** 4); // 거듭제곱(승)
console.log("2 ** 0.5 =", 2 ** 0.5);
console.log("2 ** (1/3) =", 2 ** (1 / 3));
// ()를 통해서 명시적으로 먼저 계산할 수 있다
// 연산자에는 각각의 우선순위들이 있는데 일반적으로 외우기보다는 ()를 통해서 먼저 계산하게 하면 된다

